uses GraphABC;
begin;
  //маленькие настройки
  SetWindowWidth(1366);
  SetWindowHeight(768);
  //дом
    //каркас дома
    rectangle(100, 350, 350, 600);
    //крыша
    line(100, 350, 225, 225);
    line(225, 225, 350, 350);
    line(105, 350, 225, 230);
    line(225, 230, 345, 350);
    //дверь
    rectangle(125, 475, 200, 600);
    rectangle(127, 477, 198, 598);
    //дверная ручка
    line(175, 550, 190, 545);
    line(190, 550, 190, 545);
    line(175, 550, 190, 550);
    //окно
    rectangle(225, 425, 325, 525);
    rectangle(227, 427, 323, 448);
    rectangle(227, 450, 258, 523);
    rectangle(260, 450, 290, 523);
    rectangle(292, 450, 323, 523);
  //снеговик
    //маленький ком
    circle(680, 300, 50);
    arc(680, 300, 40, -35, -145);
    line(660, 275, 660, 300);
    line(700, 275, 700, 300);
    //средний ком
    circle(680, 425, 75);
    //большой ком
    circle(680, 600, 100);
end.
